---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ApplicationEntryPoint..::..GetRibbonPanels Method
ApplicationEntryPoint Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetRibbonPanels()()()() | (Overrides UIApplication..::..GetRibbonPanels()()()().) |
|  | GetRibbonPanels(String) | (Overrides UIApplication..::..GetRibbonPanels(String).) |
|  | GetRibbonPanels(Tab) | (Overrides UIApplication..::..GetRibbonPanels(Tab).) |

# See Also

ApplicationEntryPoint Class

ApplicationEntryPoint Members

Autodesk.Revit.UI.Macros Namespace